airship/soap-envelopes/create_contact.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns1="https://secure.airship.co.uk/SOAP/V3/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:createContact>
			<username xsi:type="xsd:string">{{username}}</username>
			<password xsi:type="xsd:string">{{password}}</password>
			<contactData xsi:type="ns1:contactObject">
				<firstname xsi:type="xsd:string">{{first_name}}</firstname>
				<mobilenumber xsi:type="xsd:string">{{mobile_number}}</mobilenumber>
				<email xsi:type="xsd:string">{{email}}</email>
				<allowemail xsi:type="xsd:string">{{allow_email}}</allowemail>
				<sourceid xsi:type="xsd:string">{{source_id}}</sourceid>
			</contactData>
			<groups SOAP-ENC:arrayType="xsd:int[1]" xsi:type="ns1:GroupArray">
				<item xsi:type="xsd:int">{{group_id}}</item>
			</groups>
			<consents SOAP-ENC:arrayType="ns1:updateContactConsent[1]" xsi:type="ns1:updateContactConsentArray">
				<item xsi:type="ns1:updateContactConsent">
					<consenttypeid xsi:type="xsd:string">1</consenttypeid>
					<consentstatus xsi:type="xsd:string">{{allow_email}}</consentstatus>
				</item>
			</consents>
		</ns1:createContact>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>